# Ghost Protocol — Brewfile
# Usage: brew bundle --file=~/Code/dotfiles/Brewfile

# Terminal tools
brew "tmux"
brew "neovim"
brew "starship"
brew "eza"
brew "zoxide"
brew "fzf"
brew "bat"
brew "lazygit"
brew "ripgrep"
brew "fd"
brew "stow"
brew "sesh"

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Fonts
cask "font-jetbrains-mono-nerd-font"
